package edu.java.tasks.loops;

public class DistanceService {

    // тут нужно посчитать длину вектора, вектор начинается в 0й точке
    // и заканчивается в координате, которая задана массивом vector.
    // Длина вектора это корень квадратный суммы квадратов расстояний
    // от начала до конца вектора по каждой из осей координат.
    // Если массив пустой, то длина вектора равна нулю.
    public double calcLength(double[] vector) {
        return -1; // todo

    }

    // посчитать расстояние между двумя точками
    // (как и выше, корень от суммы квадратов разностей)
    // если у векторов разная длина, то расстояние равно нулю
    // если оба вектора нулевой длины, то расстояние тоже равно нулю
    public double calcDistance(double[] a, double[] b) {
        return -1; // todo
    }
}
